SEA TOYOTA/Web Services/wsdl_facturacion.xml

<?xml version="1.0" encoding="UTF-8"?><wsdl:definitions name="os_DEALER_Envio_Facturacion_VMS_0004_SI" targetNamespace="urn:toyota.cl:dealer:envio_facturacion_vms_0004" xmlns:p1="urn:toyota.cl:dealer:envio_facturacion_vms_0004" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"><wsdl:documentation/><wsp:UsingPolicy wsdl:required="true"/><wsp:Policy wsu:Id="OP_os_DEALER_Envio_Facturacion_VMS_0004_SI"/><wsdl:types><xsd:schema targetNamespace="urn:toyota.cl:dealer:envio_facturacion_vms_0004" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="urn:toyota.cl:dealer:envio_facturacion_vms_0004"><xsd:element name="DEALER_Envio_Facturacion_Resp_MT" type="DEALER_Envio_Facturacion_Resp_DT"/><xsd:element name="DEALER_Envio_Facturacion_MT" type="DEALER_Envio_Facturacion_DT"/><xsd:complexType name="DEALER_Envio_Facturacion_Resp_DT"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/VersionID">e34c25e3b40911e2b0f70050569b0131</xsd:appinfo></xsd:annotation><xsd:sequence><xsd:element name="Data" maxOccurs="unbounded"><xsd:complexType><xsd:sequence><xsd:element name="RETURN" type="xsd:string" minOccurs="0"/></xsd:sequence></xsd:complexType></xsd:element></xsd:sequence></xsd:complexType><xsd:complexType name="DEALER_Envio_Facturacion_DT"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/VersionID">a1021890f0a711e2cf8f0050569b0131</xsd:appinfo></xsd:annotation><xsd:sequence><xsd:element name="CODIGO_DEALER" type="xsd:string"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">27f46dc0b8c311e294c70060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="Row" maxOccurs="unbounded"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">e35b9ac0b67011e2ab4b0060737afeeb</xsd:appinfo></xsd:annotation><xsd:complexType><xsd:sequence><xsd:element name="CODIGO_SUCURSAL" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3a1b67011e2c0a00060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="TIPO_FACTURA" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">346d7970bd9611e2ca36006073539000</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="FECHA_FACTURA" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">346d7971bd9611e2916a006073539000</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="NUMERO_FACTURA" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">a0f80670f0a711e2ac70006073539000</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="REFERENCIA" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">729a4a50c95a11e2a2eb006073539000</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="NOMBRE_USUARIO" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3a2b67011e283c00060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="MODELO_VEHICULO" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3a3b67011e294150060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="NUM_STOCK" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">1db83250bd6a11e29618006073539000</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="VERSION_VEHICULO" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3a4b67011e2be430060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="COLOR_VEHICULO" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3a5b67011e2b8340060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="STOCK_ASIG" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3a6b67011e29c2f0060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="NOMBRE_CLIENTE" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3a7b67011e28af10060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="RUT_CLIENTE" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3a8b67011e2af650060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="TEL_CLIENTE" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3a9b67011e2b71f0060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="NOM_USUA_FINAL" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3aab67011e28d9d0060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="NOM2_USUA_FINAL" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">a0f80671f0a711e29d45006073539000</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="APEP_USUA_FINAL" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">a0f80672f0a711e28673006073539000</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="APEM_USUA_FINAL" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">a0f80673f0a711e28908006073539000</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="RUT_ASUA_FINAL" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3abb67011e2b1170060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="MAIL_USUA_FINAL" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3acb67011e2b97e0060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="NOM_VENDEDOR" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3adb67011e291e10060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="RUT_VENDEDOR" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3aeb67011e282570060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="ACCESORIOS" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3afb67011e2cc990060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="MONTO_FACTURA" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3b0b67011e29cd30060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="MONEDA" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3b1b67011e2b9800060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="MAR_VEHI_RETOMA" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3b2b67011e2cfc60060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="MOD_VEHI_RETOMA" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3b3b67011e2b14a0060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="ANO_VEHI_RETOMA" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3b4b67011e2a1b40060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="INST_CREDITO" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3b5b67011e2c4e70060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="TIPO_CREDITO" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3b6b67011e2c0530060737afeeb</xsd:appinfo></xsd:annotation></xsd:element><xsd:element name="INST_SEGURO" type="xsd:string" minOccurs="0"><xsd:annotation><xsd:appinfo source="http://sap.com/xi/TextID">b61ad3b7b67011e2cb170060737afeeb</xsd:appinfo></xsd:annotation></xsd:element></xsd:sequence></xsd:complexType></xsd:element></xsd:sequence></xsd:complexType></xsd:schema></wsdl:types><wsdl:message name="DEALER_Envio_Facturacion_MT"><wsdl:documentation/><wsdl:part name="DEALER_Envio_Facturacion_MT" element="p1:DEALER_Envio_Facturacion_MT"/></wsdl:message><wsdl:message name="DEALER_Envio_Facturacion_Resp_MT"><wsdl:documentation/><wsdl:part name="DEALER_Envio_Facturacion_Resp_MT" element="p1:DEALER_Envio_Facturacion_Resp_MT"/></wsdl:message><wsdl:portType name="os_DEALER_Envio_Facturacion_VMS_0004_SI"><wsdl:documentation/><wsdl:operation name="os_DEALER_Envio_Facturacion_VMS_0004_SI"><wsdl:documentation/><wsp:Policy><wsp:PolicyReference URI="#OP_os_DEALER_Envio_Facturacion_VMS_0004_SI"/></wsp:Policy><wsdl:input message="p1:DEALER_Envio_Facturacion_MT"/><wsdl:output message="p1:DEALER_Envio_Facturacion_Resp_MT"/></wsdl:operation></wsdl:portType><wsdl:binding name="os_DEALER_Envio_Facturacion_VMS_0004_SIBinding" type="p1:os_DEALER_Envio_Facturacion_VMS_0004_SI"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/><wsdl:operation name="os_DEALER_Envio_Facturacion_VMS_0004_SI"><soap:operation soapAction="http://sap.com/xi/WebService/soap1.1" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/><wsdl:input><soap:body use="literal" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/></wsdl:input><wsdl:output><soap:body use="literal" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="os_DEALER_Envio_Facturacion_VMS_0004_SIService"><wsdl:port name="HTTP_Port" binding="p1:os_DEALER_Envio_Facturacion_VMS_0004_SIBinding"><soap:address location="http://sea.toyotachile.cl:8100/XISOAPAdapter/MessageServlet?senderParty=&amp;senderService=BS_DEALER_PRD&amp;receiverParty=&amp;receiverService=&amp;interface=os_DEALER_Envio_Facturacion_VMS_0004_SI&amp;interfaceNamespace=urn%3Atoyota.cl%3Adealer%3Aenvio_facturacion_vms_0004" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/></wsdl:port><wsdl:port name="HTTPS_Port" binding="p1:os_DEALER_Envio_Facturacion_VMS_0004_SIBinding"><soap:address location="https://prd-pi.toyota.cl:50001/XISOAPAdapter/MessageServlet?senderParty=&amp;senderService=BS_DEALER_PRD&amp;receiverParty=&amp;receiverService=&amp;interface=os_DEALER_Envio_Facturacion_VMS_0004_SI&amp;interfaceNamespace=urn%3Atoyota.cl%3Adealer%3Aenvio_facturacion_vms_0004" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/></wsdl:port></wsdl:service></wsdl:definitions>